Revit 2027 API
BuiltInFailures.InaccurateFailures Class
 Failures about Inaccurate.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class InaccurateFailures
Public NotInheritable Class InaccurateFailures
public ref class InaccurateFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type InaccurateFailures = class end
The BuiltInFailures.InaccurateFailures type exposes the following members.
Properties
Name | Description
InaccurateAreaLine |  Area separation line is slightly off axis and may cause inaccuracies.
InaccurateBeamOrBrace |  Beam or Brace is slightly off axis and may cause inaccuracies.
InaccurateCurveBasedFamily |  Curve-Based Family is slightly off axis and may cause inaccuracies.
InaccurateDriveCurve |  Element is slightly off axis and may cause inaccuracies.
InaccurateGrid |  Grid is slightly off axis and may cause inaccuracies.
InaccurateLevel |  Level is slightly off axis and may cause inaccuracies.
InaccurateLine |  Line is slightly off axis and may cause inaccuracies.
InaccurateMassingSketchLine |  Line in Massing Sketch is slightly off axis and may cause inaccuracies.
InaccurateRefPlane |  Ref Plane is slightly off axis and may cause inaccuracies.
InaccurateRoomSeparation |  Room separation line is slightly off axis and may cause inaccuracies.
InaccurateSketchLine |  Line in Sketch is slightly off axis and may cause inaccuracies.
InaccurateSpaceSeparation |  Space separation line is slightly off axis and may cause inaccuracies.
InaccurateWall |  Wall is slightly off axis and may cause inaccuracies.
Top
See Also
Reference
Autodesk.Revit.DB Namespace